[{"id": "emt-001", "level": "EMT", "type": "mc", "domain": "Scene Size-Up and Safety", "topic": "Scene Safety", "difficulty": "easy", "stem": "You arrive at a residential call for a reported stabbing. As you approach the front door, you hear shouting from inside. What is your BEST course of action?", "options": ["Enter immediately to treat the patient", "Stage at a safe distance and request law enforcement", "Announce yourself loudly and enter", "Have your partner enter while you wait by the ambulance"], "correct": 1, "explanation": "Scene safety is the first priority. A violent scene with ongoing shouting indicates the threat may still be active. EMTs should stage and wait for law enforcement to secure the scene before entering."}, {"id": "emt-002", "level": "EMT", "type": "mc", "domain": "Scene Size-Up and Safety", "topic": "BSI/PPE", "difficulty": "easy", "stem": "You are dispatched to a call for a patient with severe vomiting and diarrhea. What is the MINIMUM level of PPE you should don before patient contact?", "options": ["Gloves only", "Gloves and eye protection", "Gloves, gown, and eye protection", "N95 respirator and gloves"], "correct": 1, "explanation": "When there is potential for splash exposure from vomiting, gloves and eye protection are the minimum appropriate PPE. A gown may also be advisable but gloves and eye protection are the minimum for splash risk."}, {"id": "emt-003", "level": "EMT", "type": "mc", "domain": "Scene Size-Up and Safety", "topic": "Mechanism of Injury", "difficulty": "medium", "stem": "You arrive at a motor vehicle collision where a sedan struck a tree at approximately 40 mph. The windshield has a spider-web crack and the steering column is bent. The driver is still seated. Based on the mechanism of injury, what injuries should you have a HIGH index of suspicion for?", "options": ["Isolated extremity fractures", "Head injury and thoracic trauma", "Abdominal injury only", "Minor soft tissue injuries"], "correct": 1, "explanation": "A spider-web windshield crack suggests head impact, and a bent steering column suggests thoracic impact (chest striking the steering wheel). This mechanism should raise suspicion for traumatic brain injury, cervical spine injury, and thoracic injuries such as cardiac contusion, rib fractures, or pneumothorax."}, {"id": "emt-004", "level": "EMT", "type": "mc", "domain": "Scene Size-Up and Safety", "topic": "Number of Patients", "difficulty": "medium", "stem": "You arrive at a two-vehicle collision at an intersection. Your initial scene size-up reveals one car with two occupants and another car with a driver. Bystanders report a pedestrian was also struck. How many patients should you initially plan for?", "options": ["2", "3", "4", "5"], "correct": 2, "explanation": "Scene size-up must account for all potential patients: two occupants in the first car, one driver in the second car, and one pedestrian — totaling four patients. Early recognition of multiple patients allows for timely resource requests."}, {"id": "emt-005", "level": "EMT", "type": "mc", "domain": "Scene Size-Up and Safety", "topic": "Hazardous Materials", "difficulty": "hard", "stem": "You are dispatched to an industrial facility where workers report a chemical spill. You see a placard on a container displaying a \"4\" in the red diamond. This indicates:", "options": ["Severe health hazard", "Extreme flammability", "Severe reactivity hazard", "Radioactive material"], "correct": 1, "explanation": "In the NFPA 704 diamond system, the red diamond represents flammability. A rating of 4 indicates material that will rapidly vaporize at normal pressure and temperature, or is readily dispersed in air and will burn readily — the highest flammability rating."}, {"id": "emt-006", "level": "EMT", "type": "mc", "domain": "Scene Size-Up and Safety", "topic": "Scene Safety", "difficulty": "medium", "stem": "You respond to a call at a residence for an unconscious person. Upon arrival, you notice two people lying motionless near the front door and detect a faint odor of rotten eggs. You should:", "options": ["Enter and begin assessing the closest patient", "Retreat upwind, establish a perimeter, and call for hazmat", "Enter with an N95 respirator and begin treatment", "Ventilate the area by opening windows before entering"], "correct": 1, "explanation": "The odor of rotten eggs suggests hydrogen sulfide or a natural gas leak (mercaptan odorant). Multiple unconscious persons near the entrance strongly suggests a toxic atmosphere. EMTs should not enter; retreat upwind and request hazmat resources."}, {"id": "emt-007", "level": "EMT", "type": "mc", "domain": "Scene Size-Up and Safety", "topic": "Nature of Illness", "difficulty": "easy", "stem": "Dispatch sends you to a residence for a 67-year-old male with \"difficulty breathing.\" Which of the following should you consider as part of determining the nature of illness?", "options": ["Only the patient's chief complaint", "The dispatch information, patient presentation, and environmental clues", "The hospital destination preference", "Only the physical exam findings"], "correct": 1, "explanation": "Determining the nature of illness requires integrating all available information: dispatch details, the patient's chief complaint, their presentation, medications and medical history, and environmental clues at the scene."}, {"id": "emt-008", "level": "EMT", "type": "mc", "domain": "Scene Size-Up and Safety", "topic": "Standard Precautions", "difficulty": "hard", "stem": "You are treating a patient who is coughing up blood-tinged sputum and has a documented history of active tuberculosis. Which PPE components are appropriate? (Select ALL that apply)", "options": ["Nitrile gloves", "N95 or higher respirator", "Surgical mask on the patient", "Safety glasses or goggles", "Standard surgical mask for the EMT"], "correct": 0, "explanation": "Active TB requires airborne precautions. The EMT needs an N95 respirator (not a standard surgical mask), gloves, and eye protection due to blood-tinged sputum splash risk. Placing a surgical mask on the patient helps reduce airborne droplet nuclei."}, {"id": "emt-009", "level": "EMT", "type": "mc", "domain": "Scene Size-Up and Safety", "topic": "Mechanism of Injury", "difficulty": "hard", "stem": "You respond to a shooting at a convenience store. The patient was struck by a single round from a handgun in the right upper quadrant of the abdomen. You should suspect injury to:", "options": ["The liver", "The spleen", "The left kidney", "The descending colon"], "correct": 0, "explanation": "The liver occupies most of the right upper quadrant of the abdomen. A gunshot wound to the RUQ should raise high suspicion for liver injury, which can cause life-threatening hemorrhage. Bullets can also cause damage along an unpredictable path."}, {"id": "emt-010", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "General Impression", "difficulty": "easy", "stem": "You approach a 45-year-old female sitting on a park bench who called 911 for chest pain. She is awake, speaking in full sentences, and appears anxious. Your general impression suggests:", "options": ["A patient in critical condition requiring immediate intervention", "A patient who appears stable but requires further assessment", "A patient who does not need EMS evaluation", "A patient who should be treated as a trauma alert"], "correct": 1, "explanation": "The general impression is formed in the first few seconds. This patient is alert, speaking in full sentences (adequate airway and breathing), and conscious. While chest pain is potentially serious, her current presentation appears stable. Further assessment is needed to determine severity."}, {"id": "emt-011", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Airway Management", "difficulty": "medium", "stem": "You are treating an unresponsive 30-year-old male found lying supine. He has sonorous (snoring) respirations. What is the MOST appropriate initial airway intervention?", "options": ["Insert an oropharyngeal airway immediately", "Perform a head-tilt chin-lift maneuver", "Begin bag-valve-mask ventilations", "Suction the airway for 30 seconds"], "correct": 1, "explanation": "Snoring respirations indicate the tongue is partially obstructing the airway. The initial intervention should be a manual airway maneuver — head-tilt chin-lift for a non-trauma patient. This may resolve the obstruction. An OPA can then be considered as an adjunct."}, {"id": "emt-012", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Airway Management", "difficulty": "medium", "stem": "A 7-year-old child was pulled from a swimming pool and is unresponsive. You attempt to insert an oropharyngeal airway and the child gags. Your next action should be:", "options": ["Force the OPA past the gag reflex", "Remove the OPA and insert a nasopharyngeal airway", "Remove the OPA and maintain the airway with a manual maneuver", "Remove the OPA and begin chest compressions"], "correct": 1, "explanation": "If a patient gags on an OPA, it must be removed immediately as it can cause vomiting and aspiration. A nasopharyngeal airway (NPA) is better tolerated in patients with an intact gag reflex and can help maintain airway patency."}, {"id": "emt-013", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Breathing Assessment", "difficulty": "easy", "stem": "A 55-year-old male is found sitting tripod position, using accessory muscles, and speaking in 2-3 word sentences. His respiratory rate is 28 breaths per minute. This patient's breathing is BEST described as:", "options": ["Adequate", "Inadequate", "Normal with mild anxiety", "Agonal"], "correct": 1, "explanation": "Signs of inadequate breathing include: use of accessory muscles, tripod positioning, inability to speak in full sentences, and tachypnea. This patient is showing significant respiratory distress with multiple signs of inadequate breathing."}, {"id": "emt-014", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Circulation", "difficulty": "medium", "stem": "You are assessing a 22-year-old female involved in a motorcycle crash. She has a rapid, weak radial pulse at 124 bpm, cool and pale skin, and is confused. Her blood pressure is 84/60 mmHg. These findings are MOST consistent with:", "options": ["Neurogenic shock", "Compensated hypovolemic shock", "Decompensated hypovolemic shock", "Psychogenic shock"], "correct": 2, "explanation": "This patient shows signs of decompensated shock: hypotension (systolic BP <90), tachycardia, altered mental status, and cool/pale skin. In hypovolemic shock, when compensatory mechanisms fail and blood pressure drops, the patient has entered decompensated shock — a late and ominous finding."}, {"id": "emt-015", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "AVPU", "difficulty": "easy", "stem": "You call out to your patient and she opens her eyes and moans but does not give a coherent answer. Using the AVPU scale, this patient is classified as:", "options": ["Alert", "Verbal", "Painful", "Unresponsive"], "correct": 1, "explanation": "The AVPU scale assesses responsiveness. 'V' (Verbal) indicates the patient responds to verbal stimuli. This patient opened her eyes and vocalized in response to your voice, which classifies her as responsive to verbal stimuli."}, {"id": "emt-016", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Airway Obstruction", "difficulty": "medium", "stem": "A 3-year-old child is sitting in his mother's lap, drooling, and making high-pitched inspiratory sounds. He is conscious and has good skin color. What is the MOST appropriate action?", "options": ["Perform abdominal thrusts", "Attempt to visualize the airway and remove any obstruction", "Allow the child to remain in a position of comfort and transport immediately", "Perform back blows and chest thrusts"], "correct": 2, "explanation": "A conscious child with stridor who is maintaining their own airway should be kept calm in a position of comfort. Agitating the child with invasive interventions could worsen the obstruction. Rapid transport is essential. This presentation could indicate croup, epiglottitis, or a partial foreign body obstruction."}, {"id": "emt-017", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Cardiac Arrest", "difficulty": "medium", "stem": "You arrive to find a 60-year-old male unresponsive on the kitchen floor. He is not breathing and has no pulse. Bystanders state he collapsed 3 minutes ago. What is your FIRST action?", "options": ["Apply the AED", "Begin high-quality chest compressions", "Deliver two rescue breaths", "Establish an airway with an OPA"], "correct": 1, "explanation": "Per current guidelines (AHA/ILCOR), the sequence for witnessed adult cardiac arrest is C-A-B (Compressions-Airway-Breathing). High-quality chest compressions should be initiated immediately. The AED should be applied as soon as available, but compressions take priority."}, {"id": "emt-018", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Breathing Assessment", "difficulty": "hard", "stem": "You are ventilating an apneic adult patient with a BVM. You notice the chest is not rising with ventilations. You reposition the airway and try again with no improvement. Your next step should be:", "options": ["Ventilate more forcefully", "Insert an oropharyngeal airway and reattempt ventilation", "Begin chest compressions", "Attempt blind finger sweeps"], "correct": 1, "explanation": "When BVM ventilations fail to produce chest rise after repositioning, the next step is to use an airway adjunct (OPA for an unresponsive patient without gag reflex) and reattempt. If still unsuccessful, consider obstruction and follow FBAO protocols. Ventilating more forcefully increases gastric distension risk."}, {"id": "emt-019", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Hemorrhage Control", "difficulty": "easy", "stem": "A 35-year-old construction worker has a deep laceration to the forearm with bright red blood spurting from the wound. What is the FIRST step in controlling this hemorrhage?", "options": ["Apply a tourniquet proximal to the wound", "Apply direct pressure with a sterile dressing", "Elevate the extremity above the heart", "Apply a pressure point at the brachial artery"], "correct": 1, "explanation": "The initial step for external hemorrhage control is direct pressure with a sterile dressing. While tourniquets are appropriate for life-threatening extremity hemorrhage that cannot be controlled by direct pressure, direct pressure remains the first intervention attempted."}, {"id": "emt-020", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Hemorrhage Control", "difficulty": "hard", "stem": "You apply direct pressure to a traumatic amputation of the left leg below the knee, but blood continues to soak through multiple dressings. Your next intervention should be:", "options": ["Apply additional dressings and continue direct pressure", "Apply a commercial tourniquet proximal to the wound", "Clamp the bleeding vessel", "Pack the wound with hemostatic gauze only"], "correct": 1, "explanation": "When direct pressure fails to control life-threatening extremity hemorrhage, a tourniquet should be applied proximal to the wound. Current evidence supports early tourniquet application for uncontrolled extremity hemorrhage. Clamping vessels is not an EMT skill."}, {"id": "emt-021", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Spinal Motion Restriction", "difficulty": "medium", "stem": "A 19-year-old male dove into a shallow pool and is now lying at the edge of the pool, conscious, complaining of neck pain and tingling in both arms. You should:", "options": ["Apply a cervical collar and manually stabilize the spine", "Assist the patient to a sitting position and assess further", "Immobilize only if the patient cannot move his extremities", "Wait for advanced life support to arrive before touching the patient"], "correct": 0, "explanation": "This mechanism (diving into shallow water) combined with neck pain and bilateral upper extremity tingling strongly suggests cervical spine injury. Immediate manual in-line stabilization followed by cervical collar application is indicated. Spinal motion restriction should not be delayed."}, {"id": "emt-022", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Pediatric Assessment", "difficulty": "medium", "stem": "You are called for a 2-year-old who is \"not acting right.\" Using the Pediatric Assessment Triangle, you observe the child is limp, not making eye contact, and has mottled skin with rapid breathing. This child is BEST classified as:", "options": ["Stable with normal findings", "Respiratory distress", "Cardiopulmonary failure", "Respiratory failure"], "correct": 2, "explanation": "The Pediatric Assessment Triangle evaluates appearance, work of breathing, and circulation to skin. This child has abnormal appearance (limp, no eye contact), abnormal work of breathing (rapid), and abnormal circulation (mottled skin) — all three sides are abnormal, indicating cardiopulmonary failure, the most critical category."}, {"id": "emt-023", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Shock Recognition", "difficulty": "hard", "stem": "A 28-year-old male fell 15 feet from a ladder and is complaining of severe back pain. He has a blood pressure of 88/50, heart rate of 56, and warm, dry skin below the level of injury. This presentation is MOST consistent with:", "options": ["Hypovolemic shock", "Neurogenic shock", "Cardiogenic shock", "Anaphylactic shock"], "correct": 1, "explanation": "Neurogenic shock results from spinal cord injury disrupting sympathetic nervous system control. The classic triad is hypotension, bradycardia, and warm/dry skin below the injury level (due to loss of vascular tone and sympathetic input). This differs from hypovolemic shock, which presents with tachycardia and cool, pale skin."}, {"id": "emt-024", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "CPR Quality", "difficulty": "medium", "stem": "During two-rescuer CPR on an adult, what is the correct compression-to-ventilation ratio and compression depth?", "options": ["30:2, at least 2 inches deep", "15:2, at least 2 inches deep", "30:2, at least 1.5 inches deep", "15:2, at least 1.5 inches deep"], "correct": 0, "explanation": "For adult CPR (one or two rescuers without an advanced airway), the compression-to-ventilation ratio is 30:2. Compressions should be at least 2 inches (5 cm) deep but not more than 2.4 inches, at a rate of 100-120 per minute, allowing full chest recoil."}, {"id": "emt-025", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "AED Use", "difficulty": "easy", "stem": "You are performing CPR on an adult patient and the AED is now available. After applying the pads, the AED analyzes and advises \"No shock advised.\" You should:", "options": ["Remove the AED pads and continue CPR", "Immediately resume CPR for 2 minutes", "Check for a pulse before resuming CPR", "Turn off the AED and transport immediately"], "correct": 1, "explanation": "When the AED advises no shock, immediately resume CPR starting with compressions for 2 minutes (5 cycles of 30:2). The AED pads should remain in place for continued monitoring. The AED will reanalyze after the 2-minute interval."}, {"id": "emt-026", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Respiratory Emergency", "difficulty": "hard", "stem": "A 70-year-old female with a history of COPD is found in severe respiratory distress. She is cyanotic, has diminished breath sounds bilaterally, and a respiratory rate of 8. Her SpO2 reads 78%. You should:", "options": ["Apply a nasal cannula at 2 LPM and transport", "Apply a non-rebreather mask at 15 LPM", "Assist ventilations with a BVM at 15 LPM oxygen", "Withhold oxygen due to COPD history"], "correct": 2, "explanation": "This patient has inadequate breathing (rate of 8, cyanosis, SpO2 78%). A respiratory rate below 10 with signs of hypoxia requires assisted ventilations with a BVM. The concern about suppressing hypoxic drive in COPD patients does NOT apply when the patient is in respiratory failure — always treat the immediate life threat."}, {"id": "emt-027", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Stroke Assessment", "difficulty": "medium", "stem": "A 72-year-old male presents with sudden onset right-sided facial droop, slurred speech, and left arm weakness. His symptoms began 45 minutes ago. Which prehospital stroke scale finding is this patient demonstrating?", "options": ["Positive Cincinnati Prehospital Stroke Scale — all three components", "Negative Cincinnati Prehospital Stroke Scale", "Positive for facial droop only", "Findings inconsistent with stroke"], "correct": 0, "explanation": "The Cincinnati Prehospital Stroke Scale assesses three components: facial droop, arm drift, and speech. This patient has facial droop (right-sided), arm drift/weakness (left arm), and abnormal speech (slurred). Any one abnormal finding suggests stroke; all three are positive here. Time of onset (45 minutes) is within the treatment window."}, {"id": "emt-028", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Allergic Reaction", "difficulty": "medium", "stem": "A 25-year-old female was stung by a bee 10 minutes ago. She now has widespread hives, facial swelling, wheezing, and a blood pressure of 78/40. She has a prescribed epinephrine auto-injector. You should:", "options": ["Administer oral diphenhydramine and transport", "Assist the patient with her epinephrine auto-injector immediately", "Apply cold packs to the sting site and monitor", "Wait for ALS for epinephrine administration"], "correct": 1, "explanation": "This patient is in anaphylaxis — a life-threatening allergic reaction with systemic signs (hives, airway compromise with wheezing, and hypotension). Epinephrine is the first-line treatment for anaphylaxis. EMTs can assist with a patient's prescribed auto-injector. Do not delay administration."}, {"id": "emt-029", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Chest Pain Assessment", "difficulty": "hard", "stem": "A 52-year-old male presents with crushing substernal chest pain radiating to his left arm, diaphoresis, and nausea. He has prescribed nitroglycerin. His blood pressure is 96/60. Should you assist with his nitroglycerin?", "options": ["Yes, administer one tablet sublingually immediately", "No, his systolic blood pressure is below 100 mmHg", "Yes, but only after establishing IV access", "No, nitroglycerin is contraindicated with nausea"], "correct": 1, "explanation": "Nitroglycerin is a vasodilator and can further decrease blood pressure. It is contraindicated when systolic BP is below 100 mmHg (per most protocols). Administering nitroglycerin to this hypotensive patient could cause dangerous hypotension. Continue assessment, administer oxygen if indicated, and transport promptly."}, {"id": "emt-030", "level": "EMT", "type": "mc", "domain": "Secondary Assessment", "topic": "Vital Signs", "difficulty": "easy", "stem": "When assessing a stable medical patient, how often should you reassess vital signs?", "options": ["Every 5 minutes", "Every 15 minutes", "Every 30 minutes", "Only once during transport"], "correct": 1, "explanation": "Stable patients should have vital signs reassessed every 15 minutes. Unstable patients require reassessment every 5 minutes. Serial vital signs help identify trends indicating improvement or deterioration."}, {"id": "emt-031", "level": "EMT", "type": "mc", "domain": "Secondary Assessment", "topic": "SAMPLE History", "difficulty": "easy", "stem": "You are obtaining a SAMPLE history from a patient with abdominal pain. The \"M\" in SAMPLE stands for:", "options": ["Mechanism of injury", "Medications", "Medical history", "Mental status"], "correct": 1, "explanation": "SAMPLE stands for Signs/Symptoms, Allergies, Medications, Pertinent past medical history, Last oral intake, and Events leading up to the incident. The 'M' specifically refers to all medications the patient is currently taking, including prescriptions, over-the-counter, and supplements."}, {"id": "emt-032", "level": "EMT", "type": "mc", "domain": "Secondary Assessment", "topic": "Physical Exam", "difficulty": "medium", "stem": "During a secondary assessment of a trauma patient, you palpate crepitus over the right lateral chest wall. This finding suggests:", "options": ["Subcutaneous emphysema", "Rib fractures", "Abdominal distension", "Muscle spasm"], "correct": 1, "explanation": "Crepitus (a crackling or grating sensation) palpated over the chest wall indicates bone fragments moving against each other, most commonly from rib fractures. This finding should raise concern for potential underlying lung injury such as pneumothorax."}, {"id": "emt-033", "level": "EMT", "type": "mc", "domain": "Secondary Assessment", "topic": "Detailed Physical Exam", "difficulty": "hard", "stem": "During a rapid trauma assessment of an unresponsive patient after a fall, which of the following are components you should assess? (Select ALL that apply)", "options": ["DCAP-BTLS to all body regions", "Pupil size and reactivity", "Patient's insurance information", "Distal pulses, motor, and sensation in extremities", "Lung sounds"], "correct": 0, "explanation": "A rapid trauma assessment includes a systematic head-to-toe evaluation checking DCAP-BTLS (Deformities, Contusions, Abrasions, Punctures/Penetrations, Burns, Tenderness, Lacerations, Swelling), pupil assessment, lung sounds, and distal neurovascular status. Insurance information is not part of the physical assessment."}, {"id": "emt-034", "level": "EMT", "type": "mc", "domain": "Patient Treatment and Transport", "topic": "Oxygen Administration", "difficulty": "easy", "stem": "A patient with mild respiratory distress has an SpO2 of 92% on room air. The MOST appropriate initial oxygen delivery device is:", "options": ["Nasal cannula at 2-6 LPM", "Non-rebreather mask at 15 LPM", "Bag-valve mask at 15 LPM", "Simple face mask at 6-10 LPM"], "correct": 0, "explanation": "For patients with mild respiratory distress and an SpO2 of 92%, a nasal cannula at 2-6 LPM is appropriate. It provides 24-44% oxygen concentration and is well tolerated. A non-rebreather mask is reserved for more severe hypoxia or respiratory distress."}, {"id": "emt-035", "level": "EMT", "type": "mc", "domain": "Patient Treatment and Transport", "topic": "Splinting", "difficulty": "medium", "stem": "A patient has a suspected fracture of the right tibia. When applying a splint, you should immobilize:", "options": ["Only the fracture site", "The joint above and below the fracture", "The entire extremity from hip to toes", "Only the joint above the fracture"], "correct": 1, "explanation": "Proper splinting technique requires immobilizing the joint above (knee) and the joint below (ankle) the suspected fracture site. This prevents movement at the fracture site, reducing pain, further injury, and bleeding."}, {"id": "emt-036", "level": "EMT", "type": "mc", "domain": "Patient Treatment and Transport", "topic": "Diabetic Emergency", "difficulty": "medium", "stem": "A 45-year-old diabetic patient is found confused, diaphoretic, and trembling. His blood glucose reads 42 mg/dL. He is able to swallow. You should:", "options": ["Administer oral glucose", "Administer insulin", "Place the patient supine and transport", "Withhold all treatment and transport immediately"], "correct": 0, "explanation": "This patient is hypoglycemic (blood glucose below 70 mg/dL) with altered mental status but can still swallow. Oral glucose is the appropriate EMT-level treatment. The patient must have an intact gag reflex and ability to swallow before administering oral glucose."}, {"id": "emt-037", "level": "EMT", "type": "mc", "domain": "Patient Treatment and Transport", "topic": "Spinal Immobilization", "difficulty": "medium", "stem": "You are preparing to immobilize a supine trauma patient on a long backboard. The correct sequence for securing the patient is:", "options": ["Head first, then torso, then legs", "Torso first, then legs, then head", "Legs first, then torso, then head", "All straps simultaneously"], "correct": 1, "explanation": "When securing a patient to a backboard, the torso is secured first, then the legs, and finally the head. If the head is secured first and the torso moves, the cervical spine could be compromised. Securing the torso first provides a stable anchor point."}, {"id": "emt-038", "level": "EMT", "type": "mc", "domain": "Patient Treatment and Transport", "topic": "Burns", "difficulty": "hard", "stem": "A 30-year-old male has full-thickness burns to his entire right arm and the anterior chest. Using the Rule of Nines for an adult, the estimated total body surface area burned is:", "options": ["18%", "27%", "9%", "36%"], "correct": 1, "explanation": "Using the adult Rule of Nines: the entire right arm (front and back) = 9%, and the anterior chest = 18% (the anterior trunk is 18%). Total = 9% + 18% = 27%. This patient has critical burns requiring transport to a burn center."}, {"id": "emt-039", "level": "EMT", "type": "mc", "domain": "Patient Treatment and Transport", "topic": "Poisoning", "difficulty": "medium", "stem": "A 4-year-old child accidentally ingested an unknown household cleaner approximately 20 minutes ago. The child is alert and crying. After ensuring scene safety and airway management, you should:", "options": ["Induce vomiting with syrup of ipecac", "Administer activated charcoal immediately", "Contact Poison Control and transport", "Give the child milk to dilute the substance"], "correct": 2, "explanation": "EMTs should contact Poison Control (1-800-222-1222) for guidance on specific ingestions. Inducing vomiting is NOT recommended for caustic substance ingestion as it causes additional esophageal damage. Activated charcoal is not appropriate for all ingestions. Transport while following Poison Control guidance."}, {"id": "emt-040", "level": "EMT", "type": "mc", "domain": "Patient Treatment and Transport", "topic": "Childbirth", "difficulty": "hard", "stem": "You are assisting with a field delivery. After the baby's head delivers, you notice the umbilical cord is wrapped around the neck. You should:", "options": ["Push the baby's head back in and transport immediately", "Attempt to gently slip the cord over the baby's head", "Clamp and cut the cord immediately before the body delivers", "Pull firmly on the cord to unwrap it"], "correct": 1, "explanation": "A nuchal cord (cord around the neck) is common and usually manageable. The first attempt should be to gently slip the cord over the baby's head. If it is too tight to slip over the head, clamp the cord in two places and cut between the clamps before delivering the body. Never push the head back in."}, {"id": "emt-041", "level": "EMT", "type": "mc", "domain": "Patient Treatment and Transport", "topic": "Hypothermia", "difficulty": "medium", "stem": "A 60-year-old homeless male is found outdoors in 25°F weather. He is confused, shivering has stopped, and his heart rate is 48 bpm. This patient is MOST likely experiencing:", "options": ["Mild hypothermia", "Moderate hypothermia", "Severe hypothermia", "Frostbite without hypothermia"], "correct": 2, "explanation": "Cessation of shivering, altered mental status (confusion), and bradycardia in a cold-exposure patient indicate severe hypothermia (core temp generally below 86°F/30°C). Shivering stops as the body's thermoregulation fails. Handle this patient gently to avoid triggering cardiac dysrhythmias."}, {"id": "emt-042", "level": "EMT", "type": "mc", "domain": "Patient Treatment and Transport", "topic": "Behavioral Emergency", "difficulty": "medium", "stem": "You respond to a patient who is threatening self-harm with a knife. The patient is alone in a bedroom. You should:", "options": ["Enter the room and try to talk the patient into dropping the knife", "Retreat and wait for law enforcement to secure the scene", "Attempt to restrain the patient with your partner", "Call medical direction for permission to enter"], "correct": 1, "explanation": "An armed patient is a scene safety threat. EMTs should not approach an armed individual regardless of the circumstances. Retreat to safety and request law enforcement to secure the scene and the weapon before approaching the patient."}, {"id": "emt-043", "level": "EMT", "type": "mc", "domain": "Patient Treatment and Transport", "topic": "Seizures", "difficulty": "easy", "stem": "A patient is actively seizing. Which of the following is the MOST appropriate action?", "options": ["Restrain the patient's extremities to prevent injury", "Place a bite block between the patient's teeth", "Protect the patient from injury and suction as needed", "Hold the patient's tongue to prevent airway obstruction"], "correct": 2, "explanation": "During an active seizure, the EMT should move objects away from the patient to prevent injury, not restrain the patient. Never place objects in the mouth. After the seizure, position the patient on their side (recovery position), suction as needed, and assess for injuries."}, {"id": "emt-044", "level": "EMT", "type": "mc", "domain": "Operations", "topic": "Ambulance Operations", "difficulty": "easy", "stem": "When operating an ambulance with lights and sirens, you approach a red traffic light at an intersection. You should:", "options": ["Proceed through without stopping since you have lights and sirens", "Come to a complete stop, ensure all lanes are clear, then proceed", "Slow down and proceed with caution", "Turn off lights and sirens before entering the intersection"], "correct": 1, "explanation": "Even with emergency lights and sirens activated, ambulance operators must come to a complete stop at red lights and stop signs. Proceed only after ensuring all lanes of traffic have yielded and it is safe to enter the intersection."}, {"id": "emt-045", "level": "EMT", "type": "mc", "domain": "Operations", "topic": "Incident Command", "difficulty": "medium", "stem": "You are the first emergency unit on scene at a bus crash with approximately 20 patients. Your FIRST action in establishing incident command should be:", "options": ["Begin triaging patients immediately", "Assume incident command and transmit a brief initial report", "Request additional resources before doing anything else", "Begin treating the most critically injured patient"], "correct": 1, "explanation": "The first arriving unit should assume incident command (IC) and provide a brief initial report including location, nature of incident, estimated number of patients, and apparent hazards. This establishes the command structure and initiates appropriate resource response. Triage follows after IC is established."}, {"id": "emt-046", "level": "EMT", "type": "mc", "domain": "Operations", "topic": "Triage", "difficulty": "hard", "stem": "During START triage at a mass casualty incident, you encounter a patient who is not breathing. You open the airway and the patient begins breathing at 20 breaths per minute. This patient should be triaged as:", "options": ["Red (Immediate)", "Yellow (Delayed)", "Green (Minor)", "Black (Expectant)"], "correct": 0, "explanation": "In START triage, if a patient is not breathing initially but begins breathing after a simple airway maneuver, they are categorized as Red (Immediate). They required intervention to breathe, indicating they need immediate care. If they did not breathe after airway opening, they would be Black (Expectant)."}, {"id": "emt-047", "level": "EMT", "type": "mc", "domain": "Operations", "topic": "Hazmat Zones", "difficulty": "medium", "stem": "At a hazardous materials incident, patient decontamination takes place in the:", "options": ["Hot zone", "Warm zone", "Cold zone", "Treatment area"], "correct": 1, "explanation": "The warm zone (contamination reduction zone) is where decontamination takes place. The hot zone is the contaminated area where only hazmat-trained personnel in appropriate PPE may enter. The cold zone is the safe area where the command post and treatment areas are established."}, {"id": "emt-048", "level": "EMT", "type": "mc", "domain": "Operations", "topic": "Extrication", "difficulty": "medium", "stem": "Your patient is trapped in a vehicle and requires extrication. While the rescue team works, the EMT's primary role is to:", "options": ["Operate the extrication tools", "Maintain patient care and cervical spine stabilization", "Direct the extrication operation", "Clear debris from around the vehicle"], "correct": 1, "explanation": "During extrication, the EMT's primary role is patient care. This includes maintaining cervical spine stabilization, monitoring the patient's condition, providing reassurance, and protecting the patient from hazards (covering with a blanket, etc.). Extrication tools are typically operated by trained rescue personnel."}, {"id": "emt-049", "level": "EMT", "type": "mc", "domain": "Operations", "topic": "Landing Zone", "difficulty": "hard", "stem": "You are setting up a helicopter landing zone. The minimum recommended size for the LZ during daytime operations is:", "options": ["60 × 60 feet", "75 × 75 feet", "100 × 100 feet", "50 × 50 feet"], "correct": 2, "explanation": "The minimum recommended helicopter landing zone size is 100 × 100 feet (approximately 30 × 30 meters) for daytime operations. The area should be flat, free of debris and overhead obstructions (wires, trees), and marked at the corners. Nighttime operations may require a larger area."}, {"id": "emt-050", "level": "EMT", "type": "mc", "domain": "Primary Assessment", "topic": "Pediatric Cardiac Arrest", "difficulty": "hard", "stem": "You are performing two-rescuer CPR on a 5-year-old child without an advanced airway. What compression-to-ventilation ratio should you use?", "options": ["30:2", "15:2", "30:1", "5:1"], "correct": 1, "explanation": "For two-rescuer CPR on a child (age 1 to puberty), the compression-to-ventilation ratio is 15:2. This differs from single-rescuer CPR (30:2) and provides more ventilations proportionally, which is important because pediatric cardiac arrest is more commonly respiratory in origin."}]